In [4]:
import numpy as np
import pandas as pd

### 3. Convert and merge json files into one Pandas.Dataframe

In [5]:
data1 = [{'name': 'JOHN', 'age': 27}, {'name': 'HENRY2', 'age': 14}]
data2 = { 1:{'name': 'vikash', 'age': 27}, 2:{'name': 'Satyam', 'age': 14} }
data3 = [{'id': 1, 'name': "Cole Volk", 'fitness': {'height': 130, 'weight': 60}}, {'name': "Mose Reg", 'fitness': {'height': 130, 'weight': 60}}, {'id': 2, 'name': 'Faye Raker', 'fitness': {'height': 130, 'weight': 60}}]

In [8]:
df1 = pd.DataFrame(data1)
df1

     name  age
0    JOHN   27
1  HENRY2   14

In [16]:
df2 = pd.DataFrame(data2)
df2 = df2.T
df2

     name age
1  vikash  27
2  Satyam  14

In [25]:
df3 = pd.concat([df1,df2], sort=False)
df3

     name age
0    JOHN  27
1  HENRY2  14
1  vikash  27
2  Satyam  14

In [26]:
df4 = pd.DataFrame(data3)
df4

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mose Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [28]:
df4_fitness = pd.DataFrame([i for i in df4.fitness])
df4_fitness

   height  weight
0     130      60
1     130      60
2     130      60

In [31]:
df5 = pd.concat([df4, df4_fitness], axis=1).drop("fitness", axis=1)
df5

    id        name  height  weight
0  1.0   Cole Volk     130      60
1  NaN    Mose Reg     130      60
2  2.0  Faye Raker     130      60

In [33]:
pd.merge(df3, df5, how="outer", on="name")

         name  age   id  height  weight
0        JOHN   27  NaN     NaN     NaN
1      HENRY2   14  NaN     NaN     NaN
2      vikash   27  NaN     NaN     NaN
3      Satyam   14  NaN     NaN     NaN
4   Cole Volk  NaN  1.0   130.0    60.0
5    Mose Reg  NaN  NaN   130.0    60.0
6  Faye Raker  NaN  2.0   130.0    60.0

In [32]:
# Json verisinden(dosyasından) dataframe oluşturmanın kısa yolu 
df6 = pd.DataFrame.from_dict(pd.json_normalize(data3), orient="columns")
df6

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mose Reg             130              60
2  2.0  Faye Raker             130              60

### 3. How can we convert a Series to DataFrame?

In [35]:
s = pd.Series(["p", "q", "r"],
              name="vals")

In [36]:
s.to_frame()  # Seriden Dataframe oluşturmak için

  vals
0    p
1    q
2    r

### 4. How to convert String to date?

In [34]:
from datetime import datetime    
    
# Define dates as the strings       
date_str1 = 'Wednesday, July 14, 2018'    
date_str2 = '14/7/17'    
date_str3 = '07-14-2017'    
    
# Define dates as the datetime objects    
dmy_dt1 = datetime.strptime(date_str1, '%A, %B %d, %Y')    
dmy_dt2 = datetime.strptime(date_str2, '%d/%m/%y')    
dmy_dt3 = datetime.strptime(date_str3, '%m-%d-%Y')    
    
#Print the converted dates    
print(dmy_dt1, dmy_dt2, dmy_dt3) 

type(dmy_dt1), type(dmy_dt2), type(dmy_dt3)

2018-07-14 00:00:00 2017-07-14 00:00:00 2017-07-14 00:00:00

(datetime.datetime, datetime.datetime, datetime.datetime)